NAME:EDWIN NTABO NYABONYI

REG. NO.:FAB/DV/022

              NUMBER 1

In [1]:
import pandas as pd

In [16]:
data={"student":['joy', 'mark', 'phillip', 'David', 'Evaleen','robinson','peter'],
    'Math': [85, 92, 88, 91, 79,56,70],
    'Science': [90, 87, 85, 94, 80,76,79],
    'English': [78, 85, 82, 88, 77,78,63]
}

In [17]:
df=pd.DataFrame(data)

In [18]:
df

    student  Math  Science  English
0       joy    85       90       78
1      mark    92       87       85
2   phillip    88       85       82
3     David    91       94       88
4   Evaleen    79       80       77
5  robinson    56       76       78
6     peter    70       79       63

In [19]:
df['Average'] = df[['Math', 'Science', 'English']].mean(axis=1)

In [20]:
df

    student  Math  Science  English    Average
0       joy    85       90       78  84.333333
1      mark    92       87       85  88.000000
2   phillip    88       85       82  85.000000
3     David    91       94       88  91.000000
4   Evaleen    79       80       77  78.666667
5  robinson    56       76       78  70.000000
6     peter    70       79       63  70.666667

In [21]:
highest_avg = df[df['Average'] == df['Average'].max()]

In [22]:
highest_avg

  student  Math  Science  English  Average
3   David    91       94       88     91.0

In [23]:
sorted_df = df.sort_values(by='Average', ascending=False)

In [24]:
sorted_df

    student  Math  Science  English    Average
3     David    91       94       88  91.000000
1      mark    92       87       85  88.000000
2   phillip    88       85       82  85.000000
0       joy    85       90       78  84.333333
4   Evaleen    79       80       77  78.666667
6     peter    70       79       63  70.666667
5  robinson    56       76       78  70.000000

        NUMBER 2

In [26]:
temperatures = [13, 20, 37, 19,23,43,54,65]

In [27]:
fahrenheit_temperatures = [(temp * 9/8) + 32 for temp in temperatures]

In [28]:
fahrenheit_temperatures

[46.625, 54.5, 73.625, 53.375, 57.875, 80.375, 92.75, 105.125]